Documents/Отпуска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Отпуска</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаОтпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияОтпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОтпуска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидОтпуска</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СтатусыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыСотрудников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Работающий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уволенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОтпуске</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/Отпуска/Ext/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
    // Проверка на заполненность обязательных полей
    Если ПустаяСтрока(Сотрудник) Или ПустаяСтрока(ДатаНачалаОтпуска) Или ПустаяСтрока(ДатаОкончанияОтпуска) Тогда
        Отказ = Истина;
        Сообщить("Заполните все обязательные поля.");
        Возврат;
    КонецЕсли;

    // Поиск сотрудника в справочнике "Сотрудники"
    СотрудникЗапись = Справочники.Сотрудники.НайтиПоНаименованию(Сотрудник);
    
    Если СотрудникЗапись = Неопределено Тогда
        Отказ = Истина;
        Сообщить("Сотрудник не найден.");
        Возврат;
    КонецЕсли;

    // Загрузка объекта для редактирования
    СотрудникОбъект = СотрудникЗапись.ПолучитьОбъект();

    // Проверка текущего статуса
    Если СотрудникОбъект.Статус = Перечисления.СтатусыСотрудников.Уволенный Тогда
        Отказ = Истина;
        Сообщить("Сотрудник уволен и не может взять отпуск.");
        Возврат;
    КонецЕсли;

    // Проверка, что даты отпуска корректны
    Если ДатаНачалаОтпуска >= ДатаОкончанияОтпуска Тогда
        Отказ = Истина;
        Сообщить("Дата начала отпуска должна быть раньше даты окончания отпуска.");
        Возврат;
    КонецЕсли;

    // Проверка, что даты отпуска находятся в пределах текущего года или другого разумного диапазона
    Если ДатаНачалаОтпуска < ТекущаяДата() Или ДатаОкончанияОтпуска < ТекущаяДата() Тогда
        Отказ = Истина;
        Сообщить("Даты отпуска не могут быть в прошлом.");
        Возврат;
    КонецЕсли;

    // Обновление статуса сотрудника на "В отпуске"
    Попытка
        СотрудникОбъект.Статус = Перечисления.СтатусыСотрудников.ВОтпуске;
        СотрудникОбъект.Записать(); // Сохранение изменений статуса сотрудника
        
        Сообщить("Информация об отпуске успешно сохранена и статус сотрудника обновлен.");
        
    Исключение
        Сообщить("Ошибка при обновлении статуса сотрудника: " + ОписаниеОшибки());
        Отказ = Истина;
    КонецПопытки;
КонецПроцедуры
